city/stress.yml
config:
  target: "https://onpremise-elegislative-frontend.cloudmateria.com/"
  phases:
    # Ramp-up phase: gradually increase the traffic over 10 minutes.
    - duration: 600               # 10 minutes of ramp-up
      arrivalRate: 20              # Start with 20 users per second
      rampTo: 500                 # Ramp to 500 users per second by the end of 10 minutes

    # Peak load phase: maintain a high load for 15 minutes (500 users/sec).
    - duration: 900               # 15 minutes at high load
      arrivalRate: 500             # Sustained 500 users per second

    # Stress Phase: simulate a sudden spike to peak load.
    - duration: 600               # 10 minutes of very high stress
      arrivalRate: 1000            # Ramp to 1000 users per second

    # Ramp-down phase: gradually decrease the load over 5 minutes.
    - duration: 300               # 5 minutes ramp-down
      arrivalRate: 200             # Ramp down to 200 users/sec

  tls:
    rejectUnauthorized: false

scenarios:
  - name: "Stress Test on /"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
          # Adding think time to simulate real user behavior
          think: 2   # Simulate a user thinking for 2 seconds before the next request